{"name": "cchess_model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 14, 10, 9], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "input_conv-5-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "input_conv-5-192", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "input_batchnorm", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "input_batchnorm", "inbound_nodes": [[["input_conv-5-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "input_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "input_relu", "inbound_nodes": [[["input_batchnorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res1_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res1_conv1-3-192", "inbound_nodes": [[["input_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res1_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res1_batchnorm1", "inbound_nodes": [[["res1_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res1_relu1", "inbound_nodes": [[["res1_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res1_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res1_conv2-3-192", "inbound_nodes": [[["res1_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res1_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res1_batchnorm2", "inbound_nodes": [[["res1_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res1_add", "trainable": true, "dtype": "float32"}, "name": "res1_add", "inbound_nodes": [[["input_relu", 0, 0, {}], ["res1_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res1_relu2", "inbound_nodes": [[["res1_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_conv1-3-192", "inbound_nodes": [[["res1_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res2_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res2_batchnorm1", "inbound_nodes": [[["res2_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res2_relu1", "inbound_nodes": [[["res2_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res2_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res2_conv2-3-192", "inbound_nodes": [[["res2_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res2_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res2_batchnorm2", "inbound_nodes": [[["res2_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res2_add", "trainable": true, "dtype": "float32"}, "name": "res2_add", "inbound_nodes": [[["res1_relu2", 0, 0, {}], ["res2_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res2_relu2", "inbound_nodes": [[["res2_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_conv1-3-192", "inbound_nodes": [[["res2_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res3_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res3_batchnorm1", "inbound_nodes": [[["res3_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res3_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res3_relu1", "inbound_nodes": [[["res3_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res3_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res3_conv2-3-192", "inbound_nodes": [[["res3_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res3_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res3_batchnorm2", "inbound_nodes": [[["res3_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res3_add", "trainable": true, "dtype": "float32"}, "name": "res3_add", "inbound_nodes": [[["res2_relu2", 0, 0, {}], ["res3_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res3_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res3_relu2", "inbound_nodes": [[["res3_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_conv1-3-192", "inbound_nodes": [[["res3_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res4_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res4_batchnorm1", "inbound_nodes": [[["res4_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res4_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res4_relu1", "inbound_nodes": [[["res4_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res4_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res4_conv2-3-192", "inbound_nodes": [[["res4_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res4_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res4_batchnorm2", "inbound_nodes": [[["res4_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res4_add", "trainable": true, "dtype": "float32"}, "name": "res4_add", "inbound_nodes": [[["res3_relu2", 0, 0, {}], ["res4_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res4_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res4_relu2", "inbound_nodes": [[["res4_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res5_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res5_conv1-3-192", "inbound_nodes": [[["res4_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res5_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res5_batchnorm1", "inbound_nodes": [[["res5_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res5_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res5_relu1", "inbound_nodes": [[["res5_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res5_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res5_conv2-3-192", "inbound_nodes": [[["res5_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res5_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res5_batchnorm2", "inbound_nodes": [[["res5_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res5_add", "trainable": true, "dtype": "float32"}, "name": "res5_add", "inbound_nodes": [[["res4_relu2", 0, 0, {}], ["res5_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res5_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res5_relu2", "inbound_nodes": [[["res5_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res6_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res6_conv1-3-192", "inbound_nodes": [[["res5_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res6_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res6_batchnorm1", "inbound_nodes": [[["res6_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res6_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res6_relu1", "inbound_nodes": [[["res6_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res6_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res6_conv2-3-192", "inbound_nodes": [[["res6_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res6_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res6_batchnorm2", "inbound_nodes": [[["res6_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res6_add", "trainable": true, "dtype": "float32"}, "name": "res6_add", "inbound_nodes": [[["res5_relu2", 0, 0, {}], ["res6_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res6_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res6_relu2", "inbound_nodes": [[["res6_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res7_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res7_conv1-3-192", "inbound_nodes": [[["res6_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res7_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res7_batchnorm1", "inbound_nodes": [[["res7_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res7_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res7_relu1", "inbound_nodes": [[["res7_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res7_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res7_conv2-3-192", "inbound_nodes": [[["res7_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res7_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res7_batchnorm2", "inbound_nodes": [[["res7_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res7_add", "trainable": true, "dtype": "float32"}, "name": "res7_add", "inbound_nodes": [[["res6_relu2", 0, 0, {}], ["res7_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res7_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res7_relu2", "inbound_nodes": [[["res7_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res8_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res8_conv1-3-192", "inbound_nodes": [[["res7_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res8_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res8_batchnorm1", "inbound_nodes": [[["res8_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res8_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res8_relu1", "inbound_nodes": [[["res8_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res8_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res8_conv2-3-192", "inbound_nodes": [[["res8_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res8_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res8_batchnorm2", "inbound_nodes": [[["res8_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res8_add", "trainable": true, "dtype": "float32"}, "name": "res8_add", "inbound_nodes": [[["res7_relu2", 0, 0, {}], ["res8_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res8_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res8_relu2", "inbound_nodes": [[["res8_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res9_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res9_conv1-3-192", "inbound_nodes": [[["res8_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res9_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res9_batchnorm1", "inbound_nodes": [[["res9_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res9_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res9_relu1", "inbound_nodes": [[["res9_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res9_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res9_conv2-3-192", "inbound_nodes": [[["res9_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res9_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res9_batchnorm2", "inbound_nodes": [[["res9_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res9_add", "trainable": true, "dtype": "float32"}, "name": "res9_add", "inbound_nodes": [[["res8_relu2", 0, 0, {}], ["res9_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res9_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res9_relu2", "inbound_nodes": [[["res9_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res10_conv1-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res10_conv1-3-192", "inbound_nodes": [[["res9_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res10_batchnorm1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res10_batchnorm1", "inbound_nodes": [[["res10_conv1-3-192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res10_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res10_relu1", "inbound_nodes": [[["res10_batchnorm1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "res10_conv2-3-192", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "res10_conv2-3-192", "inbound_nodes": [[["res10_relu1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "res10_batchnorm2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "res10_batchnorm2", "inbound_nodes": [[["res10_conv2-3-192", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "res10_add", "trainable": true, "dtype": "float32"}, "name": "res10_add", "inbound_nodes": [[["res9_relu2", 0, 0, {}], ["res10_batchnorm2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "res10_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "res10_relu2", "inbound_nodes": [[["res10_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "value_conv-1-4", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "value_conv-1-4", "inbound_nodes": [[["res10_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "policy_conv-1-2", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "policy_conv-1-2", "inbound_nodes": [[["res10_relu2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "value_batchnorm", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "value_batchnorm", "inbound_nodes": [[["value_conv-1-4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "policy_batchnorm", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "policy_batchnorm", "inbound_nodes": [[["policy_conv-1-2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "value_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "value_relu", "inbound_nodes": [[["value_batchnorm", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "policy_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "policy_relu", "inbound_nodes": [[["policy_batchnorm", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "value_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "value_flatten", "inbound_nodes": [[["value_relu", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "policy_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "policy_flatten", "inbound_nodes": [[["policy_relu", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "value_dense", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "value_dense", "inbound_nodes": [[["value_flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "policy_out", "trainable": true, "dtype": "float32", "units": 2086, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "policy_out", "inbound_nodes": [[["policy_flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "value_out", "trainable": true, "dtype": "float32", "units": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "value_out", "inbound_nodes": [[["value_dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["policy_out", 0, 0], ["value_out", 0, 0]]}